{
  "char2idx": {
    "<PAD>": 0,
    "<SOS>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "0": 4,
    "1": 5,
    "2": 6,
    "3": 7,
    "5": 8,
    "7": 9,
    "8": 10,
    "9": 11,
    "a": 12,
    "b": 13,
    "c": 14,
    "d": 15,
    "e": 16,
    "f": 17,
    "g": 18,
    "h": 19,
    "i": 20,
    "j": 21,
    "k": 22,
    "l": 23,
    "m": 24,
    "n": 25,
    "o": 26,
    "p": 27,
    "q": 28,
    "r": 29,
    "s": 30,
    "t": 31,
    "u": 32,
    "v": 33,
    "w": 34,
    "x": 35,
    "y": 36,
    "z": 37,
    "\u00e0": 38,
    "\u00e1": 39,
    "\u00e8": 40,
    "\u00e9": 41,
    "\u00ed": 42,
    "\u021b": 43,
    "\u022f": 44,
    "\u0430": 45,
    "\u0432": 46,
    "\u0434": 47,
    "\u0435": 48,
    "\u0436": 49,
    "\u0438": 50,
    "\u043c": 51,
    "\u043d": 52,
    "\u043e": 53,
    "\u044b": 54,
    "\u0451": 55,
    "\u0901": 56,
    "\u0902": 57,
    "\u0903": 58,
    "\u0905": 59,
    "\u0906": 60,
    "\u0907": 61,
    "\u0908": 62,
    "\u0909": 63,
    "\u090a": 64,
    "\u090b": 65,
    "\u090d": 66,
    "\u090e": 67,
    "\u090f": 68,
    "\u0910": 69,
    "\u0911": 70,
    "\u0912": 71,
    "\u0913": 72,
    "\u0914": 73,
    "\u0915": 74,
    "\u0916": 75,
    "\u0917": 76,
    "\u0918": 77,
    "\u0919": 78,
    "\u091a": 79,
    "\u091b": 80,
    "\u091c": 81,
    "\u091d": 82,
    "\u091e": 83,
    "\u091f": 84,
    "\u0920": 85,
    "\u0921": 86,
    "\u0922": 87,
    "\u0923": 88,
    "\u0924": 89,
    "\u0925": 90,
    "\u0926": 91,
    "\u0927": 92,
    "\u0928": 93,
    "\u092a": 94,
    "\u092b": 95,
    "\u092c": 96,
    "\u092d": 97,
    "\u092e": 98,
    "\u092f": 99,
    "\u0930": 100,
    "\u0931": 101,
    "\u0932": 102,
    "\u0933": 103,
    "\u0935": 104,
    "\u0936": 105,
    "\u0937": 106,
    "\u0938": 107,
    "\u0939": 108,
    "\u093c": 109,
    "\u093d": 110,
    "\u093e": 111,
    "\u093f": 112,
    "\u0940": 113,
    "\u0941": 114,
    "\u0942": 115,
    "\u0943": 116,
    "\u0945": 117,
    "\u0946": 118,
    "\u0947": 119,
    "\u0948": 120,
    "\u0949": 121,
    "\u094a": 122,
    "\u094b": 123,
    "\u094c": 124,
    "\u094d": 125,
    "\u0958": 126,
    "\u0959": 127,
    "\u095a": 128,
    "\u095b": 129,
    "\u095c": 130,
    "\u095d": 131,
    "\u095e": 132,
    "\u0964": 133,
    "\u0966": 134,
    "\u0ca8": 135,
    "\u1e0d": 136,
    "\u1e43": 137,
    "\u1e5b": 138,
    "\u1e6d": 139,
    "\u3044": 140,
    "\u304a": 141,
    "\u3055": 142,
    "\u308c": 143,
    "\u3093": 144,
    "\u65c5": 145,
    "\u75b2": 146,
    "\u9577": 147
  },
  "idx2char": {
    "0": "<PAD>",
    "1": "<SOS>",
    "2": "<EOS>",
    "3": "<UNK>",
    "4": "0",
    "5": "1",
    "6": "2",
    "7": "3",
    "8": "5",
    "9": "7",
    "10": "8",
    "11": "9",
    "12": "a",
    "13": "b",
    "14": "c",
    "15": "d",
    "16": "e",
    "17": "f",
    "18": "g",
    "19": "h",
    "20": "i",
    "21": "j",
    "22": "k",
    "23": "l",
    "24": "m",
    "25": "n",
    "26": "o",
    "27": "p",
    "28": "q",
    "29": "r",
    "30": "s",
    "31": "t",
    "32": "u",
    "33": "v",
    "34": "w",
    "35": "x",
    "36": "y",
    "37": "z",
    "38": "\u00e0",
    "39": "\u00e1",
    "40": "\u00e8",
    "41": "\u00e9",
    "42": "\u00ed",
    "43": "\u021b",
    "44": "\u022f",
    "45": "\u0430",
    "46": "\u0432",
    "47": "\u0434",
    "48": "\u0435",
    "49": "\u0436",
    "50": "\u0438",
    "51": "\u043c",
    "52": "\u043d",
    "53": "\u043e",
    "54": "\u044b",
    "55": "\u0451",
    "56": "\u0901",
    "57": "\u0902",
    "58": "\u0903",
    "59": "\u0905",
    "60": "\u0906",
    "61": "\u0907",
    "62": "\u0908",
    "63": "\u0909",
    "64": "\u090a",
    "65": "\u090b",
    "66": "\u090d",
    "67": "\u090e",
    "68": "\u090f",
    "69": "\u0910",
    "70": "\u0911",
    "71": "\u0912",
    "72": "\u0913",
    "73": "\u0914",
    "74": "\u0915",
    "75": "\u0916",
    "76": "\u0917",
    "77": "\u0918",
    "78": "\u0919",
    "79": "\u091a",
    "80": "\u091b",
    "81": "\u091c",
    "82": "\u091d",
    "83": "\u091e",
    "84": "\u091f",
    "85": "\u0920",
    "86": "\u0921",
    "87": "\u0922",
    "88": "\u0923",
    "89": "\u0924",
    "90": "\u0925",
    "91": "\u0926",
    "92": "\u0927",
    "93": "\u0928",
    "94": "\u092a",
    "95": "\u092b",
    "96": "\u092c",
    "97": "\u092d",
    "98": "\u092e",
    "99": "\u092f",
    "100": "\u0930",
    "101": "\u0931",
    "102": "\u0932",
    "103": "\u0933",
    "104": "\u0935",
    "105": "\u0936",
    "106": "\u0937",
    "107": "\u0938",
    "108": "\u0939",
    "109": "\u093c",
    "110": "\u093d",
    "111": "\u093e",
    "112": "\u093f",
    "113": "\u0940",
    "114": "\u0941",
    "115": "\u0942",
    "116": "\u0943",
    "117": "\u0945",
    "118": "\u0946",
    "119": "\u0947",
    "120": "\u0948",
    "121": "\u0949",
    "122": "\u094a",
    "123": "\u094b",
    "124": "\u094c",
    "125": "\u094d",
    "126": "\u0958",
    "127": "\u0959",
    "128": "\u095a",
    "129": "\u095b",
    "130": "\u095c",
    "131": "\u095d",
    "132": "\u095e",
    "133": "\u0964",
    "134": "\u0966",
    "135": "\u0ca8",
    "136": "\u1e0d",
    "137": "\u1e43",
    "138": "\u1e5b",
    "139": "\u1e6d",
    "140": "\u3044",
    "141": "\u304a",
    "142": "\u3055",
    "143": "\u308c",
    "144": "\u3093",
    "145": "\u65c5",
    "146": "\u75b2",
    "147": "\u9577"
  },
  "phone2idx": {
    "<PAD>": 0,
    "<SOS>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "a": 4,
    "aa": 5,
    "ai": 6,
    "au": 7,
    "b": 8,
    "bh": 9,
    "c": 10,
    "ch": 11,
    "d": 12,
    "dh": 13,
    "e": 14,
    "f": 15,
    "g": 16,
    "gh": 17,
    "h": 18,
    "i": 19,
    "j": 20,
    "jh": 21,
    "k": 22,
    "kh": 23,
    "l": 24,
    "m": 25,
    "n": 26,
    "ng": 27,
    "ny": 28,
    "o": 29,
    "p": 30,
    "ph": 31,
    "r": 32,
    "ri": 33,
    "s": 34,
    "sh": 35,
    "t": 36,
    "th": 37,
    "u": 38,
    "w": 39,
    "y": 40,
    "z": 41
  },
  "idx2phone": {
    "0": "<PAD>",
    "1": "<SOS>",
    "2": "<EOS>",
    "3": "<UNK>",
    "4": "a",
    "5": "aa",
    "6": "ai",
    "7": "au",
    "8": "b",
    "9": "bh",
    "10": "c",
    "11": "ch",
    "12": "d",
    "13": "dh",
    "14": "e",
    "15": "f",
    "16": "g",
    "17": "gh",
    "18": "h",
    "19": "i",
    "20": "j",
    "21": "jh",
    "22": "k",
    "23": "kh",
    "24": "l",
    "25": "m",
    "26": "n",
    "27": "ng",
    "28": "ny",
    "29": "o",
    "30": "p",
    "31": "ph",
    "32": "r",
    "33": "ri",
    "34": "s",
    "35": "sh",
    "36": "t",
    "37": "th",
    "38": "u",
    "39": "w",
    "40": "y",
    "41": "z"
  }
}